<details ><summary>Digger run report at 2025-05-29 13:18:08 (UTC)</summary>
      <details open="true"><summary>Plan output</summary>

```terraform
Terraform will perform the following actions:

  # module.gce.google_compute_instance.competition_instance[0] must be replaced
-/+ resource "google_compute_instance" "competition_instance" {
      ~ cpu_platform            = "Unknown CPU Platform" -> (known after apply)
      ~ current_status          = "TERMINATED" -> (known after apply)
      ~ effective_labels        = {} -> (known after apply)
      - enable_display          = false -> null
      ~ guest_accelerator       = [] -> (known after apply)
      ~ id                      = "projects/kaggle-infra-exp-0808/zones/asia-northeast1-c/instances/instance-kaggle-demo" -> (known after apply)
      ~ instance_id             = "2441737989430828679" -> (known after apply)
      ~ label_fingerprint       = "42WmSpB8rSM=" -> (known after apply)
      - labels                  = {} -> null
      - metadata                = {} -> null
      ~ metadata_fingerprint    = "IsZpHED5i-I=" -> (known after apply)
      + min_cpu_platform        = (known after apply)
      ~ name                    = "instance-kaggle-demo" -> "instance-kaggle-demo-0" # forces replacement
      - resource_policies       = [] -> null
      ~ self_link               = "https://www.googleapis.com/compute/v1/projects/kaggle-infra-exp-0808/zones/asia-northeast1-c/instances/instance-kaggle-demo" -> (known after apply)
      - tags                    = [] -> null
      ~ tags_fingerprint        = "42WmSpB8rSM=" -> (known after apply)
      ~ terraform_labels        = {} -> (known after apply)
        # (8 unchanged attributes hidden)

      ~ boot_disk {
          ~ device_name                = "persistent-disk-0" -> (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          ~ source                     = "https://www.googleapis.com/compute/v1/projects/kaggle-infra-exp-0808/zones/asia-northeast1-c/disks/instance-kaggle-demo" -> (known after apply)
            # (3 unchanged attributes hidden)

          ~ initialize_params {
              - enable_confidential_compute = false -> null
              ~ image                       = "https://www.googleapis.com/compute/v1/projects/ubuntu-os-cloud/global/images/ubuntu-2004-focal-v20250508a" -> "ubuntu-os-cloud/ubuntu-2004-lts"
              ~ labels                      = {} -> (known after apply)
              ~ provisioned_iops            = 0 -> (known after apply)
              ~ provisioned_throughput      = 0 -> (known after apply)
              - resource_manager_tags       = {} -> null
              ~ size                        = 10 -> (known after apply)
              ~ type                        = "pd-standard" -> (known after apply)
                # (1 unchanged attribute hidden)
            }
        }

      ~ confidential_instance_config (known after apply)

      ~ network_interface {
          ~ internal_ipv6_prefix_length = 0 -> (known after apply)
          + ipv6_access_type            = (known after apply)
          + ipv6_address                = (known after apply)
          ~ name                        = "nic0" -> (known after apply)
          ~ network                     = "https://www.googleapis.com/compute/v1/projects/kaggle-infra-exp-0808/global/networks/default" -> "default"
          ~ network_ip                  = "10.146.0.4" -> (known after apply)
          - queue_count                 = 0 -> null
          ~ stack_type                  = "IPV4_ONLY" -> (known after apply)
          ~ subnetwork                  = "https://www.googleapis.com/compute/v1/projects/kaggle-infra-exp-0808/regions/asia-northeast1/subnetworks/default" -> (known after apply)
          ~ subnetwork_project          = "kaggle-infra-exp-0808" -> (known after apply)
            # (1 unchanged attribute hidden)

          ~ access_config {
              ~ nat_ip                 = "35.243.102.89" -> (known after apply)
              ~ network_tier           = "PREMIUM" -> (known after apply)
                # (1 unchanged attribute hidden)
            }
        }

      ~ reservation_affinity (known after apply)

      ~ scheduling (known after apply)
      - scheduling {
          - automatic_restart           = true -> null
          - min_node_cpus               = 0 -> null
          - on_host_maintenance         = "MIGRATE" -> null
          - preemptible                 = false -> null
          - provisioning_model          = "STANDARD" -> null
            # (1 unchanged attribute hidden)
        }

      - shielded_instance_config {
          - enable_integrity_monitoring = true -> null
          - enable_secure_boot          = false -> null
          - enable_vtpm                 = true -> null
        }

        # (1 unchanged block hidden)
    }

  # module.gce.google_compute_instance.competition_instance[1] will be created
  + resource "google_compute_instance" "competition_instance" {
      + can_ip_forward          = false
      + cpu_platform            = (known after apply)
      + current_status          = (known after apply)
      + deletion_protection     = false
      + effective_labels        = (known after apply)
      + guest_accelerator       = (known after apply)
      + id                      = (known after apply)
      + instance_id             = (known after apply)
      + label_fingerprint       = (known after apply)
      + machine_type            = "e2-micro"
      + metadata_fingerprint    = (known after apply)
      + metadata_startup_script = (sensitive value)
      + min_cpu_platform        = (known after apply)
      + name                    = "instance-kaggle-demo-1"
      + project                 = "kaggle-infra-exp-0808"
      + self_link               = (known after apply)
      + tags_fingerprint        = (known after apply)
      + terraform_labels        = (known after apply)
      + zone                    = "asia-northeast1-c"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image                  = "ubuntu-os-cloud/ubuntu-2004-lts"
              + labels                 = (known after apply)
              + provisioned_iops       = (known after apply)
              + provisioned_throughput = (known after apply)
              + size                   = (known after apply)
              + type                   = (known after apply)
            }
        }

      + confidential_instance_config (known after apply)

      + network_interface {
          + internal_ipv6_prefix_length = (known after apply)
          + ipv6_access_type            = (known after apply)
          + ipv6_address                = (known after apply)
          + name                        = (known after apply)
          + network                     = "default"
          + network_ip                  = (known after apply)
          + stack_type                  = (known after apply)
          + subnetwork                  = (known after apply)
          + subnetwork_project          = (known after apply)

          + access_config {
              + nat_ip       = (known after apply)
              + network_tier = (known after apply)
            }
        }

      + reservation_affinity (known after apply)

      + scheduling (known after apply)

      + service_account {
          + email  = "instance-service-account@kaggle-infra-exp-0808.iam.gserviceaccount.com"
          + scopes = [
              + "https://www.googleapis.com/auth/cloud-platform",
            ]
        }
    }

  # module.network.google_compute_address.static_ip[0] must be replaced
-/+ resource "google_compute_address" "static_ip" {
      ~ address            = "35.243.102.89" -> (known after apply)
      ~ creation_timestamp = "2025-05-26T05:36:42.688-07:00" -> (known after apply)
      ~ effective_labels   = {} -> (known after apply)
      ~ id                 = "projects/kaggle-infra-exp-0808/regions/asia-northeast1/addresses/static-ip-kaggle-demo" -> (known after apply)
      ~ label_fingerprint  = "42WmSpB8rSM=" -> (known after apply)
      - labels             = {} -> null
      ~ name               = "static-ip-kaggle-demo" -> "static-ip-kaggle-demo-0" # forces replacement
      ~ prefix_length      = 0 -> (known after apply)
      + purpose            = (known after apply)
      ~ self_link          = "https://www.googleapis.com/compute/v1/projects/kaggle-infra-exp-0808/regions/asia-northeast1/addresses/static-ip-kaggle-demo" -> (known after apply)
      + subnetwork         = (known after apply)
      ~ terraform_labels   = {} -> (known after apply)
      ~ users              = [
          - "https://www.googleapis.com/compute/v1/projects/kaggle-infra-exp-0808/zones/asia-northeast1-c/instances/instance-kaggle-demo",
        ] -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # module.network.google_compute_address.static_ip[1] will be created
  + resource "google_compute_address" "static_ip" {
      + address            = (known after apply)
      + address_type       = "EXTERNAL"
      + creation_timestamp = (known after apply)
      + effective_labels   = (known after apply)
      + id                 = (known after apply)
      + label_fingerprint  = (known after apply)
      + name               = "static-ip-kaggle-demo-1"
      + network_tier       = "PREMIUM"
      + prefix_length      = (known after apply)
      + project            = "kaggle-infra-exp-0808"
      + purpose            = (known after apply)
      + region             = "asia-northeast1"
      + self_link          = (known after apply)
      + subnetwork         = (known after apply)
      + terraform_labels   = (known after apply)
      + users              = (known after apply)
    }

Plan: 4 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────
```
</details>

<details ><summary>Terraform plan validation check (competition01)</summary>
  Terraform plan validation checks succeeded :white_check_mark:
</details>


<details ><summary>Plan summary</summary>
  
|  CHANGE  |                           RESOURCE                           |
|----------|--------------------------------------------------------------|
| add      | `module.gce.google_compute_instance.competition_instance[1]` |
|          | `module.network.google_compute_address.static_ip[1]`         |
| recreate | `module.gce.google_compute_instance.competition_instance[0]` |
|          | `module.network.google_compute_address.static_ip[0]`         |

</details>

</details>